# ControlPoints Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HermiteSpline..::..ControlPoints Property
HermiteSpline Class See Also
---
The control points of the Hermite spline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<XYZ> ControlPoints { get; set; }
```

Visual Basic
---
```text
Public Property ControlPoints As IList(Of XYZ)
	Get
	Set
```

Visual C++
---
```text
public:
property IList<XYZ^>^ ControlPoints {
	IList<XYZ^>^ get ();
	void set (IList<XYZ^>^ value);
}
```

# See Also
HermiteSpline Class
Autodesk.Revit.DB Namespace